//
//  User.swift
//  HomeWorkAboutMeApp
//
//  Created by Акира on 09.06.2023.
//

import Foundation

struct User {
    var userName = "DoctorRei"
    var userPassword = "123321"
    var userRealName = "Михаил"
    var userClan = "Кутузов"
    
    var age = "25"
    var gender = "Мужчина"
    var company = "Севстар"
    var post = "Оператор"
    var myOpinion = "Чертовски хорош"
    var parentsOpinion = "Позорище"
    var biographyFull = "Итак. Давайте в последний раз. Родился в Севастополе, 15 лет бездарной учебы в школе и еще 4 года учебы в медицинской шараге. Не то, чтобы я был в недоволен, но будучи единственный мужчиной среди 30 девушек - выживать учишься быстро и заодно неплохо подтягиваешь свой парселтанг. Далее еще 4 года работы на скорой помощи, паралелльно 3 месяца службы в армии и год работы в частной клинике. Спустя все это время приходит понимание, что все идет куда-то не туда и умереть в 40 лет от инсульта на скорой за 20к рублей в месяц - не то, о чем я мечтал. Дальше начинаю учить свифт по книге,увольняюсь со скорой и иду работать в техпод местного провайдера. На новой работе забрасываю учебу. В это время нахожу женщину и решаю вернуться к учебе, чтобы получить адекватную профессию с адекватной оплатой. Покупаю курс (рассрочка. Вы же не забыли про мое образование?), начинаю учиться, расхожусь с женщиной на которой собирался жениться, сразу же заболеваю и сразу после болезни попадаю в дтп и, как следствие, в больницу на все майские. После - две недели отпуска и вот я, вновь пилю это приложение, попутно избавлясь от привычки пить во время написани кода. Выходит плохо. Но, я крайне оптимистичный человек и, как только закончу рыдать под столом с бутылкой вина, вновь гордо подымаю голову и иду учиться дальше!  "
}

var userFirst = User()




