//
//  User.swift
//  HomeWorkAboutMeApp
//
//  Created by Акира on 09.06.2023.
//

import Foundation

struct User {
    var userName = "DoctorRei"
    var userPassword = "123321"
    var userRealName = "Михаил"
    var userClan = "Кутузов"
    
    var age = "25"
    var gender = "Мужчина"
    var company = "Севстар"
    var post = "Промолчу. Это грустно"
    var myOpinion = "Чертовски хорош"
    var parentsOpinion = "Позорище"
    var biographyFull = "Итак. Давайте в последний раз. Меня зовут Михаил Кутузов, и я все еще даже не джун. Родился в Севастополе, 15 лет бездарной учебы в школе и еще 4 года учебы в медицинской шараге. Не то, чтобы я был в недоволен, но будучи единственный мужчиной среди 30 девушек - выживать учишься быстро и заодно неплохо подтягиваешь свой Парселтанг. Далее еще 4 года работы на скорой помощи, редкая подработка детским аниматором, 3 месяца службы в армии и год работы в частной клинике. Далее пришло понимание, что чет не то и умереть в 40 лет от инсульта на этой работе за 20к рублей в месяц - не то, о чем я мечтал. Дальше бла-бла-бла, учим свифт по книжке, бросаю все, иду работать в техпод местного провайдера Интернета, работаю год, в это время нахожу женщину, решаю вернуться к учебе. Начинаю учиться, расхожусь с женщиной на которой собирался жениться, заболеваю и сразу после болезни попадаю в дтп и в больницу на все майские. Ныне пилю это пирложение и искренне не понимаю, как можно было так отвратительно сделать систему констреинтов.  "
}

var userFirst = User()




